{
    "park-info": [
        {
            "name": "Lord of the Rings...land",
            "description": "Magic Kingdom is Walt Disney World's most popular destination, and is first on everyone's list of things to experience when they arrive in Central Florida. The park is full of great attractions like Seven Dwarfs Mine Train, Space Mountain, and Jungle Cruise, and features lots of entertainment including parades, fireworks spectaculars, character meet and greets, and shows. However, the park can be overwhelming and become quite crowded, even during the low season.",
            "location": "Orlando, Florida",
            "operating_hours":[
                {
                    "opening": 9,
                    "closing": 10
                }
            ]
        }
    ],
    "areas": [
        {
            "id": 1,
            "name": "The Shire",
            "description": "The Shire is based of the area settled exclusively by Hobbits which includes Hobbiton.",
            "colorTheme": "730217"
        },
        {
            "id": 2,
            "name": "Rivendell",
            "description": "A large fortress around the tower of Orthanc by the Númenóreans in exile. .",
            "colorTheme": "D15530"
        },
        {
            "id": 3,
            "name": "Misty Mountains",
            "decription": "Rivendell is the city of the Elven folk. The name Rivendell means deeply cloven valley.",
            "colorTheme": "A37849"
        },
        {
            "id": 4,
            "name": "Isengard",
            "decription": "Liberty Square re-creates America at the time of the American Revolution. The architecture is Federal or Colonial, and provides a seamless transition from the edge of Fantasyland to Frontierland. A real, 130-year-old live oak, the Liberty Tree, lends dignity and grace to the setting.",
            "colorTheme": "2594D9"
        },
        {
            "id": 5,
            "name": "X",
            "decription": "X",
            "colorTheme": "ffffff"
        },
        {
            "id": 6,
            "name": "Minas Morgul",
            "decription": "Fantasyland the heart of the Magic Kingdom and a truly enchanting place spread gracefully like a miniature Alpine village beneath the steepled towers of Cinderella Castle is divided into three distinct sections. Directly behind Cinderella Castle and set upon a snowcapped mountain is Beast’s Castle, part of a Beauty and the Beast–themed area. The middle of Fantasyland holds the headliners, including Under the Sea - Journey of the Little Mermaid and Seven Dwarfs Mine Train. The placement of these two attractions allows good traffic flow either to the left (toward Beast’s Castle) for dining, to the right for attractions geared to smaller children, or back to the original part of Fantasyland for classic attractions such as Peter Pan’s Flight and The Many Adventures of Winnie the Pooh. The far-right corner of Fantasyland includes Dumbo the Flying Elephant, The Barnstormer featuring the Great Goofini, and the Walt Disney World Railroad - Fantasyland Station is called Storybook Circus as an homage to Disney’s Dumbo film.",
            "colorTheme": "E73C81"
        },
        {
            "id": 7,
            "name": "Rohan",
            "decription": "Here in Tomorrowland, the future is today! So, ready your rockets, boys and girls, as you blast into the twin orbits of innovation and exploration. But Tomorrowland is more than a fascinating collection of gizmos — it's a spaceport where your imagination lands each day to glimpse otherworldly wonders, embark on fantastic voyages, and witness the pioneering of the human spirit.",
            "colorTheme": "3E4D8C"
        },
        {
            "id": 8,
            "name": "Gondor",
            "description": "Rising high in the sky at the end of Main Street, U.S.A., Cinderella Castle welcomes you to a magical world of fantasy and fun. The central icon of Walt Disney World Resort, the castle invites all who visit to celebrate in a place where dreams come true.",
            "colorTheme": "F2CF53"
        },
        {
            "id": 9,
            "name": "Mordor",
            "decription": "Here in Tomorrowland, the future is today! So, ready your rockets, boys and girls, as you blast into the twin orbits of innovation and exploration. But Tomorrowland is more than a fascinating collection of gizmos — it's a spaceport where your imagination lands each day to glimpse otherworldly wonders, embark on fantastic voyages, and witness the pioneering of the human spirit.",
            "colorTheme": "3E4D8C"
        },
        
    ],
"attractions": [
        {
            "id": 1,
            "name": "Walt Disney World Railroad",
            "description": "Listen to the clamor of the engine, the chug of the wheels and the call of the whistle as you travel aboard the Walt Disney World Railroad. Offering convenient stops at Frontierland, Fantasyland and Main Street, U.S.A., it's the perfect way to preview the magic at Magic Kingdom park and take in the picturesque scenery.",
            "type_id": 1,
            "area_id": 1
        },
        {
            "id": 2,
            "name": "Main Street Vehicles",
            "description": "Catch a nostalgic ride to Cinderella Castle or Town Square aboard a vintage vehicle. Board a classic horse-drawn car, omnibus, jitney or fire engine and sit back as you are ushered from one end of Main Street, U.S.A. to the other. Along the way, behold a bevy of 2- and 3-story-high, Victorian-themed shops and restaurants from a time and place long since passed.",
            "type_id": 1,
            "area_id": 1
        },
        {
            "id": 3,
            "name": "Harmony Barber Shop",
            "description": "Whether it’s your first haircut or your hundredth, the friendly and experienced barbers at Harmony Barber Shop on Main Street, U.S.A. will entertain you while making sure you look amazing. You may even be treated to the musical talents of the Dapper Dans, Disney’s very own barbershop quartet! And there’s a special My First Haircut  package for children that includes commemorative Mickey Ears and a certificate.",
            "type_id": 4,
            "area_id": 1
        },
        {
            "id": 4,
            "name": "Emporium",
            "description": "The largest gift and souvenir shop in Magic Kingdom park, the Emporium offers apparel, plush toys, pins, candy and more. ",
            "type_id": 4,
            "area_id": 1
        },
        {
            "id": 5,
            "name": "Main Street Confectionary",
            "description": "Follow your nose inside this old-fashioned candy shop, where delightful treats including character-inspired candy apples and Mickey krispie treats are made. ",
            "type_id": 4,
            "area_id": 1
        },
        {
            "id": 6,
            "name": "The Chapeau",
            "description": "Mickey Ears, Pins & Vinylmation",
            "type_id": 4,
            "area_id": 1
        },
        {
            "id": 7,
            "name": "Uptown Jewelers",
            "description": "This quaint shop has it all—from the fine gems and charms of the Disney Parks Collection by PANDORA to gorgeous handbags, watches, Disney figurines and artist sketches, including The Art of Disney on Demand! ",
            "type_id": 4,
            "area_id": 1
        },
        {
            "id": 8,
            "name": "Crystal Arts",
            "description": "Gifts & Housewares",
            "type_id": 4,
            "area_id": 1
        },
        {
            "id": 9,
            "name": "Disney Clothiers",
            "description": "Apparel & Accessories",
            "type_id": 4,
            "area_id": 1
        },
        {
            "id": 10,
            "name": "Tony's Town Square Restaurant",
            "description": "Step inside this charming turn-of-the-century trattoria on Main Street, U.S.A., with its whitewashed balustrades, French doors and expansive front porch, which offers a fantastic view of evening parades. Take in the classic 1955 film Lady and the Tramp playing in the lobby and pictures of the 2 pooches gracing the wall.",
            "type_id": 2,
            "area_id": 1
        },
        {
            "id": 11,
            "name": "Main Street Bakery",
            "description": "Make a stop on the way down Main Street and top off your day with a tasty cup or even a mouthwatering treat—including a selection of STARBUCKS® Coffee and specialty beverages, along with Disney baked goods and La Boulange™ pastry items. ",
            "type_id": 2,
            "area_id": 1
        },
        {
            "id": 12,
            "name": "The Plaza Restaurant",
            "description": "Step inside this charming dining parlor awash in turn-of-the-century Art Nouveau touches, including beautifully embellished light fixtures and mirrors and an inviting solarium. The mayor has even been known to drop by—after all, he does live just down the street!",
            "type_id": 2,
            "area_id": 1
        },
        {
            "id": 13,
            "name": "Plaza Ice Cream Parlor",
            "description": "Indulge in hand-scooped ice cream at this sweetly nostalgic parlor on Main Street, U.S.A. Savor floats, fresh waffle-bowl sundaes smothered in hot fudge and Mickey cones with chocolate ears! Fat- and sugar-free options are also available. ",
            "type_id": 2,
            "area_id": 1
        },
        {
            "id": 14,
            "name": "Casey's Corner",
            "description": "Hit it out of the park with American baseball favorites: hot dogs, corn dog nuggets, French fries, cotton candy and Cracker Jack. You may even catch Jim tickling the ivories to ragtime tunes outside. Soft drinks are also available. ",
            "type_id": 2,
            "area_id": 1
        },
        {
            "id": 15,
            "name": "The Crystal Palace",
            "description": "Inspired by Victorian greenhouses of the late 1800s, The Crystal Palace brims with light, topiaries and tropical palms—and is an enchanting spot to meet some favorite Disney Friends!",
            "type_id": 2,
            "area_id": 1
        },
        {
            "id": 16,
            "name": "Meet Disney Friends in Town Square",
            "description": "Some of your favorite Disney friends are here to greet you in the heart of Main Street, U.S.A",
            "times": ["9:00AM", "4:00PM"],
            "type_id": 5,
            "area_id": 1
        },
        {
            "id": 17,
            "name": "Meet Mickey at Town Square Theater",
            "description": "Mickey Mouse is in his rehearsal room, ready to meet his biggest fans. Discover props and posters from Mickey’s magical career in the theater and maybe even spot a disappearing dove or a rabbit coming out of a hat. The greatest magic of all happens when you get a hug from Mickey Mouse himself.",
            "times": ["9:40AM", "12:20PM", "4:30PM"],
            "type_id": 5,
            "area_id": 1
        },
        {
            "id": 18,
            "name": "Meet Tinker Bell at Town Square Theater",
            "description": "Step through the magical portal to join Tinker Bell as she showcases a collection of her treasures from the mainland. After spending time with a fairy, you too may wish you could fly away toward the second star to the right!",
            "times": ["10:00AM", "1:00PM", "4:30PM", "7:00PM"],
            "type_id": 5,
            "area_id": 1
        },
        {
            "id": 19,
            "name": "Horses - Disney Animals",
            "description": "Look for draft horses, including Clydesdales, Percherons and Belgians, pulling the Main Street Trolley. Draft horses are the largest breed of horses and are bred to pull heavy loads. However, our Main Street Trolley is actually designed to be lightweight which helps us provide the best care and safety to our horses.",
            "type_id": 6,
            "area_id": 1
        },
        {
            "id": 20,
            "name": "Main Street Electrical Light Parade",
            "description": "Join our nighttime baroque hoedown on Main Street U.S.A as half a million lights pulsate and move to the music. ",
            "type_id": 8,
            "area_id": 1
        },
        {
            "id": 21,
            "name": "Swiss Family Treehouse",
            "description": "Cross a bridge at the foot of a large leafy tree and climb handcrafted wooden stairs as you explore the famed living quarters of the Swiss Family Robinson and learn of their island adventure.",
            "type_id": 1,
            "area_id": 2
        },
        {
            "id": 22,
            "name": "Jungle Cruise",
            "description": "Trek to a forgotten tropical jungle outpost—home to suspended cargo nets, wooden crates and lanterns—and board a canopied tramp steamer for a tongue-in-cheek adventure led by a trusty skipper through some of the world’s most treacherous rivers.",
            "type_id": 1,
            "area_id": 2
        },
        {
            "id": 23,
            "name": "Pirates of the Caribbean",
            "description": "Wander a meanderin’ alleyway within a Spanish fortress and board a small barge for a spellbinding high-seas adventure. Escape through a shadowy grotto past the ghostly catacombs of fallen pirates and swoop down a small rushing waterfall, your passageway to the Golden Age of Piracy. ",
            "type_id": 1,
            "area_id": 2
        },
        {
            "id": 24,
            "name": "The Magic Carpets of Aladdin",
            "description": "Take off on a magical ride above a bustling bazaar aboard an enchanted carpet that you control. Climb aboard a colorful, 4-passenger vehicle and take off into the air as the strings of Middle Eastern music play overhead. ",
            "type_id": 1,
            "area_id": 2
        }
    ],
"attraction_types":[
        {
            "id": 1,
            "name": "ride"
        },
        {
            "id": 2,
            "name": "restaurant"
        },
        {
            "id": 3,
            "name": "show"
        },
        {
            "id": 4,
            "name": "vendor"
        },
        {
            "id": 5,
            "name": "character meet"
        },
        {
            "id": 6,
            "name": "animals"
        },
        {
            "id": 7,
            "name": "game"
        },
        {
            "id": 8,
            "name": "special event"
        }
    ]
}
